In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
a = np.random.randint(10,size=5)
b = np.random.randint(10,size=5)
c = np.random.randint(10,size=5)

In [6]:
dictionary = {"var1":a,"var2":b,"var3":c}
dictionary

{'var1': array([0, 4, 8, 8, 5]),
 'var2': array([8, 4, 1, 2, 6]),
 'var3': array([2, 4, 8, 1, 2])}

In [38]:
df = pd.DataFrame(dictionary,index=("var1","var2","var3","var4","var5"))
df

      var1  var2  var3
var1     0     8     2
var2     4     4     4
var3     8     1     8
var4     8     2     1
var5     5     6     2

In [39]:
df["var1":"var4"] # var1 den var4'e kadar gidiyor.

      var1  var2  var3
var1     0     8     2
var2     4     4     4
var3     8     1     8
var4     8     2     1

In [40]:
df.drop("var1",axis=0)

      var1  var2  var3
var2     4     4     4
var3     8     1     8
var4     8     2     1
var5     5     6     2

In [41]:
df # Burada bir yukarıdaki blokta drop ile silinen satır ana dataframe üzerinde
# bir değişiklik yaratmadı. Ancak inplace parametresini true yaparsak kalıcı olarak dataframe
# üzerinde değişiklik olacaktır.

      var1  var2  var3
var1     0     8     2
var2     4     4     4
var3     8     1     8
var4     8     2     1
var5     5     6     2

> Inplace

In [43]:
df.drop("var3",axis=0,inplace=True) 
df

      var1  var2  var3
var2     4     4     4
var4     8     2     1
var5     5     6     2

> Fancy ile silinmesi gereken satırları liste olarak göndererek silme

In [44]:
l = ["var4","var5"]

In [46]:
df.drop(l,axis=0)

      var1  var2  var3
var2     4     4     4

In [49]:
values = ["var34","var2","var1","var4","var46"]

In [51]:
for i in values:
    print(i in l) # Burada ufak bir sorgu yaptırdık.

False
False
False
True
False

In [89]:
df["var4"] = df["var1"] / df["var2"]
df["var1"] /= 2
df

         var1  var2  var3      var4
var2  0.12500     4     4  0.062500
var4  0.25000     2     1  0.250000
var5  0.15625     6     2  0.052083

In [90]:
df.drop("var4",axis=1,inplace=True)
df

         var1  var2  var3
var2  0.12500     4     4
var4  0.25000     2     1
var5  0.15625     6     2

In [80]:
df2 = pd.DataFrame({"isimler":["jack","youness","yavuz"],"soyisimler":["rew","dasf","joeli"]})
df2

   isimler soyisimler
0     jack        rew
1  youness       dasf
2    yavuz      joeli

In [81]:
df2["isimler"] = df2["isimler"].str[0:2]
df2

  isimler soyisimler
0      ja        rew
1      yo       dasf
2      ya      joeli